'====== Логические и условные операторы'
# Логические операторы - выражения, которые возращают True, если выражение верное, False - если выражение не верное

'Равенство'
10 == 5 # False
5 == 5 # True

# print('hi' == 2)

'Не равенство'
4 != 5 # True
5 != 5 # False

'Больше'
10 > 10 # False
4 > 1 # True

'Меньше'
5 < 4 # False
10 < 10 # False
8 < 9 # True

'Больше или равно'
10 >= 4
10>=10
4>=5
'Меньше или равно'


a = 5
b = 6

not b>20 and a == 5 or b == 6 and b == 6 or not a== 5 and 5 ==10 #True

# =======     Boolean Type     =======

# =======     Тренарный оператор     =======
#Тренарный оператор - условие в одну строку
num = 23
if num >0:
    chislo=''
    



